joristork/robots/jobot_in_c/microchip_extras/h/p18f8680.h
extern volatile far  unsigned char       B4D1;
extern volatile far  struct {
  unsigned B4D10:1;
  unsigned B4D11:1;
  unsigned B4D12:1;
  unsigned B4D13:1;
  unsigned B4D14:1;
  unsigned B4D15:1;
  unsigned B4D16:1;
  unsigned B4D17:1;
} B4D1bits;
extern volatile far  unsigned char       B4D2;
extern volatile far  struct {
  unsigned B4D20:1;
  unsigned B4D21:1;
  unsigned B4D22:1;
  unsigned B4D23:1;
  unsigned B4D24:1;
  unsigned B4D25:1;
  unsigned B4D26:1;
  unsigned B4D27:1;
} B4D2bits;
extern volatile far  unsigned char       B4D3;
extern volatile far  struct {
  unsigned B4D30:1;
  unsigned B4D31:1;
  unsigned B4D32:1;
  unsigned B4D33:1;
  unsigned B4D34:1;
  unsigned B4D35:1;
  unsigned B4D36:1;
  unsigned B4D37:1;
} B4D3bits;
extern volatile far  unsigned char       B4D4;
extern volatile far  struct {
  unsigned B4D40:1;
  unsigned B4D41:1;
  unsigned B4D42:1;
  unsigned B4D43:1;
  unsigned B4D44:1;
  unsigned B4D45:1;
  unsigned B4D46:1;
  unsigned B4D47:1;
} B4D4bits;
extern volatile far  unsigned char       B4D5;
extern volatile far  struct {
  unsigned B4D50:1;
  unsigned B4D51:1;
  unsigned B4D52:1;
  unsigned B4D53:1;
  unsigned B4D54:1;
  unsigned B4D55:1;
  unsigned B4D56:1;
  unsigned B4D57:1;
} B4D5bits;
extern volatile far  unsigned char       B4D6;
extern volatile far  struct {
  unsigned B4D60:1;
  unsigned B4D61:1;
  unsigned B4D62:1;
  unsigned B4D63:1;
  unsigned B4D64:1;
  unsigned B4D65:1;
  unsigned B4D66:1;
  unsigned B4D67:1;
} B4D6bits;
extern volatile far  unsigned char       B4D7;
extern volatile far  union {
  struct {
    unsigned B4D70:1;
    unsigned B4D71:1;
    unsigned B4D72:1;
    unsigned B4D73:1;
    unsigned B4D74:1;
    unsigned B4D75:1;
    unsigned B4D76:1;
    unsigned B4D77:1;
  };
  struct {
    unsigned :7;
    unsigned B46D77:1;
  };
} B4D7bits;
extern volatile far  unsigned char       CANSTAT_RO5;
extern volatile far  struct {
  unsigned EICODE0:1;
  unsigned EICODE1_ICODE0:1;
  unsigned EICODE2_ICODE1:1;
  unsigned EICODE3_ICODE2:1;
  unsigned EICODE4:1;
  unsigned OPMODE0:1;
  unsigned OPMODE1:1;
  unsigned OPMODE2:1;
} CANSTAT_RO5bits;
extern volatile far  unsigned char       CANCON_RO5;
extern volatile far  struct {
  unsigned FP0:1;
  unsigned WIN0_FP1:1;
  unsigned WIN1_FP2:1;
  unsigned WIN2_FP3:1;
  unsigned ABAT:1;
  unsigned REQOP0:1;
  unsigned REQOP1:1;
  unsigned REQOP2:1;
} CANCON_RO5bits;
extern volatile far  unsigned char       B5CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0_TXPRI0:1;
    unsigned FILHIT1_TXPRI1:1;
    unsigned FILHIT2_RTREN:1;
    unsigned FILHIT3_TXREQ:1;
    unsigned FILHIT4_TXERR:1;
    unsigned RTRRO_TXLARB:1;
    unsigned RXM1_TXABT:1;
    unsigned RXFUL_TXBIF:1;
  };
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
} B5CONbits;
extern volatile far  unsigned char       B5SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} B5SIDHbits;
extern volatile far  unsigned char       B5SIDL;
extern volatile far  union {
  struct {
    unsigned EID16:1;
    unsigned EID17:1;
    unsigned :1;
    unsigned EXID:1;
    unsigned SRR:1;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
  struct {
    unsigned :3;
    unsigned EXIDE:1;
  };
} B5SIDLbits;
extern volatile far  unsigned char       B5EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} B5EIDHbits;
extern volatile far  unsigned char       B5EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} B5EIDLbits;
extern volatile far  unsigned char       B5DLC;
extern volatile far  union {
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RXRTR:1;
  };
  struct {
    unsigned :4;
    unsigned RESRB0:1;
    unsigned RESRB1:1;
  };
} B5DLCbits;
extern volatile far  unsigned char       B5D0;
extern volatile far  union {
  struct {
    unsigned B5D00:1;
    unsigned B5D01:1;
    unsigned B5D02:1;
    unsigned B5D03:1;
    unsigned B5D04:1;
    unsigned B5D05:1;
    unsigned B5D06:1;
    unsigned B5D07:1;
  };
  struct {
    unsigned :7;
    unsigned B57D07:1;
  };
} B5D0bits;
extern volatile far  unsigned char       B5D1;
extern volatile far  struct {
  unsigned B5D10:1;
  unsigned B5D11:1;
  unsigned B5D12:1;
  unsigned B5D13:1;
  unsigned B5D14:1;
  unsigned B5D15:1;
  unsigned B5D16:1;
  unsigned B5D17:1;
} B5D1bits;
extern volatile far  unsigned char       B5D2;
extern volatile far  union {
  struct {
    unsigned B5D20:1;
    unsigned B5D21:1;
    unsigned B5D22:1;
    unsigned B5D23:1;
    unsigned B5D24:1;
    unsigned B5D25:1;
    unsigned B5D26:1;
    unsigned B5D27:1;
  };
  struct {
    unsigned :3;
    unsigned B57D23:1;
  };
} B5D2bits;
extern volatile far  unsigned char       B5D3;
extern volatile far  struct {
  unsigned B5D30:1;
  unsigned B5D31:1;
  unsigned B5D32:1;
  unsigned B5D33:1;
  unsigned B5D34:1;
  unsigned B5D35:1;
  unsigned B5D36:1;
  unsigned B5D37:1;
} B5D3bits;
extern volatile far  unsigned char       B5D4;
extern volatile far  struct {
  unsigned B5D40:1;
  unsigned B5D41:1;
  unsigned B5D42:1;
  unsigned B5D43:1;
  unsigned B5D44:1;
  unsigned B5D45:1;
  unsigned B5D46:1;
  unsigned B5D47:1;
} B5D4bits;
extern volatile far  unsigned char       B5D5;
extern volatile far  struct {
  unsigned B5D50:1;
  unsigned B5D51:1;
  unsigned B5D52:1;
  unsigned B5D53:1;
  unsigned B5D54:1;
  unsigned B5D55:1;
  unsigned B5D56:1;
  unsigned B5D57:1;
} B5D5bits;
extern volatile far  unsigned char       B5D6;
extern volatile far  struct {
  unsigned B5D60:1;
  unsigned B5D61:1;
  unsigned B5D62:1;
  unsigned B5D63:1;
  unsigned B5D64:1;
  unsigned B5D65:1;
  unsigned B5D66:1;
  unsigned B5D67:1;
} B5D6bits;
extern volatile far  unsigned char       B5D7;
extern volatile far  struct {
  unsigned B5D70:1;
  unsigned B5D71:1;
  unsigned B5D72:1;
  unsigned B5D73:1;
  unsigned B5D74:1;
  unsigned B5D75:1;
  unsigned B5D76:1;
  unsigned B5D77:1;
} B5D7bits;
